<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Schema;

return new class extends Migration {
    /**
     * Run the migrations.
     */
    public function up(): void
    {
        Schema::create('specialized_centers', function (Blueprint $table) {
            $table->id();
            $table->string('title');
            $table->string('user')->default('0371714941');
            $table->boolean('active')->default(1);
            $table->timestamps();
            $table->softDeletes();
        });

        $Query = "INSERT INTO specialized_centers (id,title) VALUES
(1,'مرکز تخصصی حضرت ولی‌عصر(عج) [آذربایجان شرقی ـ بناب]'),
(2,'مرکز تخصصی علامه امینی(ره)[آذربایجان شرقی ـ تبریز]'),
(3,'مرکز آموزش عالی حوزوی [اصفهان ـ اصفهان]'),
(4,'مرکز تخصصی علامه مجلسی(ره) [اصفهان ـ اصفهان]'),
(5,'مرکز تخصصی امام هادی(ع) [تهران ـ تهران]'),
(6,'مرکز تخصصی امام حسن عسکری(ع) [تهران ـ تهران]'),
(7,'مرکز تخصصی دارالحکمه [تهران ـ تهران]'),
(8,'مرکز تخصصی عالم آل‌محمد(ع) [تهران ـ تهران]'),
(9,'مؤسسه تخصصی امام رضا(ع) [تهران ـ تهران]'),
(10,'مؤسسه تخصصی قاسم بن الحسن(ع) [تهران ـ تهران]'),
(11,'مرکز تخصصی امیرالمؤمنین(ع) [خوزستان ـ اهواز]'),
(12,'مرکز تخصصی بیان وحی [سمنان ـ دامغان]'),
(13,'مرکز تخصصی امام حسین(ع) [فارس ـ شیراز]'),
(14,'مؤسسه تخصصی امام خمینی(ره) [فارس ـ شیراز]'),
(15,'مرکز تخصصی علامه رفیعی(ره) [قزوین ـ قزوین]'),
(16,'مرکز تخصصی اخلاق و معنویت اسلامی [قم ـ قم]'),
(17,'مرکز تخصصی امام خامنه‌ای [قم ـ قم]'),
(18,'مرکز تخصصی امام خمینی(ره) [قم ـ قم]'),
(19,'مرکز تخصصی امام‌شناسی [قم ـ قم]'),
(20,'مرکز تخصصی امامت اهل‌بیت(ع) [قم ـ قم]'),
(21,'مرکز تخصصی تدبیر (مدیریت اسلامی) [قم ـ قم]'),
(22,'مرکز تخصصی تفسیر (فاطمی ابهری) [قم ـ قم]'),
(23,'مرکز تخصصی تفسیر ائمه اطهار(ع) [قم ـ قم]'),
(24,'مرکز تخصصی تمدن نوین اسلامی [قم ـ قم]'),
(25,'مرکز تخصصی حقوق و قضای اسلامی [قم ـ قم]'),
(26,'مرکز تخصصی دارالأعلام [قم ـ قم]'),
(27,'مرکز تخصصی دارالهدی [قم ـ قم]'),
(28,'مرکز تخصصی دین‌پژوهی علوی [قم ـ قم]'),
(29,'مرکز تخصصی رشد [قم ـ قم]'),
(30,'مرکز تخصصی شیعه‌شناسی [قم ـ قم]'),
(31,'مرکز تخصصی صادقین(ع) [قم ـ قم]'),
(32,'مرکز تخصصی علوم حدیث [قم ـ قم]'),
(33,'مرکز تخصصی علی بن ابیطالب(ع) [قم ـ قم]'),
(34,'مرکز تخصصی فجرنا [قم ـ قم]'),
(35,'مرکز تخصصی فقه و حقوق [قم ـ قم]'),
(36,'مرکز تخصصی فقه و حقوق ولی‌عصر(عج) [قم ـ قم]'),
(37,'مرکز تخصصی فلسفه اسلامی [قم ـ قم]'),
(38,'مرکز تخصصی مذاهب اسلامی [قم ـ قم]'),
(39,'مرکز تخصصی مشکوة [قم ـ قم]'),
(40,'مرکز مطالعات فلسفی اسلام و غرب [قم ـ قم]'),
(41,'مرکز تخصصی معارف اهل‌بیت(ع) [قم ـ قم]'),
(42,'مرکز تخصصی موعود(عج) [قم ـ قم]'),
(43,'مرکز تخصصی مهدویت [قم ـ قم]'),
(44,'مرکز تخصصی نجوم [قم ـ قم]'),
(45,'مرکز تخصصی نهج‌البلاغه [قم ـ قم]'),
(46,'مرکز تخصصی آل‌یاسین [قم ـ قم]'),
(47,'مرکز تخصصی تبلیغ [قم ـ قم]'),
(48,'مرکز تخصصی تفسیر و علوم قرآن [قم ـ قم]'),
(49,'مرکز تخصصی کلام اسلامی امام صادق(ع) [قم ـ قم]'),
(50,'مرکز تخصصی کلام ائمه اطهار(ع) [قم ـ قم]'),
(51,'مؤسسه آموزش عالی امام رضا(ع) [قم ـ قم]'),
(52,'مؤسسه آموزش عالی حوزوی اسرا [قم ـ قم]'),
(53,'مؤسسه آموزش عالی حوزوی تربیت مدرس [قم ـ قم]'),
(54,'مؤسسه آموزش عالی خاتم‌النبیین(ص) [قم ـ قم]'),
(55,'مؤسسه بین‌المللی مطالعات اسلامی [قم ـ قم]'),
(56,'مرکز تخصصی ولی‌عصر(عج) [گلستان ـ گرگان]'),
(57,'مرکز تخصصی امام حسن عسکری(ع) [مازندران ـ آمل]');";
        DB::statement($Query);
    }

    /**
     * Reverse the migrations.
     */
    public function down(): void
    {
        Schema::dropIfExists('specialized_centers');
    }
};
